# IMPORTAR LIBRERIAS

In [45]:
import mysql.connector as con
import pandas as pd
import pymysql # Para ver la versión
import sqlalchemy # Para ver la versión
from sqlalchemy import create_engine

In [46]:
print(f"Conector: {con.__version__}")
print(f"Pandas: {pd.__version__}")
print(f"pymysql: {pymysql.__version__}")
print(f"sqlalchemy: {sqlalchemy.__version__}")

Conector: 9.1.0
Pandas: 2.2.3
pymysql: 1.4.6
sqlalchemy: 2.0.37

# PARTE 1: CREAR BASE DE DATOS Y CREAR TABLAS

Código SQL para la creacion de base de datos y tablas

In [47]:
sql_creacion = """ 
DROP DATABASE IF EXISTS supermercado;

CREATE DATABASE IF NOT EXISTS supermercado;

USE supermercado;

CREATE TABLE IF NOT EXISTS tiendas (
    id_tienda INT AUTO_INCREMENT PRIMARY KEY,
    nombre_tienda VARCHAR(100),
    direccion VARCHAR(255),
    ciudad VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS empleados (
    id_empleado INT AUTO_INCREMENT PRIMARY KEY,
    nombre_empleado VARCHAR(100),
    puesto VARCHAR(50),
    id_tienda INT NOT NULL,
    FOREIGN KEY (id_tienda) REFERENCES tiendas (id_tienda)
);

CREATE TABLE IF NOT EXISTS categorias (
    id_categoria INT AUTO_INCREMENT PRIMARY KEY,
    nombre_categoria VARCHAR(50)
);

CREATE TABLE IF NOT EXISTS productos (
    id_producto INT AUTO_INCREMENT PRIMARY KEY,
    nombre_producto VARCHAR(100),
    precio DECIMAL(5, 2),
    stock INT,
    id_categoria INT NOT NULL,
    FOREIGN KEY (id_categoria) REFERENCES categorias (id_categoria)
);

CREATE TABLE IF NOT EXISTS clientes (
    id_cliente INT AUTO_INCREMENT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(255),
    codigo_postal INT(5)
);

CREATE TABLE IF NOT EXISTS ordenes (
    id_orden INT AUTO_INCREMENT PRIMARY KEY,
    id_cliente INT NOT NULL,
    id_empleado INT NOT NULL,
    fecha_orden DATETIME,
    metodo_pago ENUM('Tarjeta', 'Efectivo'),
    FOREIGN KEY (id_cliente) REFERENCES clientes (id_cliente),
    FOREIGN KEY (id_empleado) REFERENCES empleados (id_empleado)
);

CREATE TABLE IF NOT EXISTS detalle_orden (
    id_detalle INT AUTO_INCREMENT PRIMARY KEY,
    id_orden INT NOT NULL,
    id_producto INT NOT NULL,
    cantidad INT,
    precio_unitario DECIMAL(5, 2), -- mismo precio que en la tabla producto
    descuento DECIMAL(3, 2),
    FOREIGN KEY (id_orden) REFERENCES ordenes (id_orden),
    FOREIGN KEY (id_producto) REFERENCES productos (id_producto)
);
"""

Conexión a MySQL y ejecución de codigo de creacion

In [48]:
connection = con.connect(
    host="localhost",
    port= "3306",
    user= "root",
    password= "admin"
)

cursor = connection.cursor()
cursor.execute(sql_creacion)
cursor.close()
connection.close()

# PARTE 2: GENERAR DATOS DEMO DESDE PYTHON

In [49]:
import random

## TIENDAS

In [50]:
ciudades = ['Málaga', 'Madrid', 'San Sebastian']
brand = 'SUPER24H'
tipo_via = ['Plaza', 'Calle', 'Avenida']
nombres_calle = ['Costitución', 'Libertad', 'Conocimiento', 'Pacífico', 'América']
tienda = []
for ciudad in ciudades:
    for num in range(1,6):
        direccion = f"{random.choice(tipo_via)}, {random.choice(nombres_calle)}, {random.randint(1, 150)}"
        tienda.append([f'{brand}_{ciudad}_{num}', direccion, ciudad])

df_tienda = pd.DataFrame(tienda, columns=['nombre_tienda', 'direccion', 'ciudad'])
df_tienda=df_tienda.reset_index().rename({'index': 'id_tienda'}, axis=1)
df_tienda['id_tienda'] = df_tienda['id_tienda'] + 1
df_tienda

,id_tienda,nombre_tienda,direccion,ciudad
0,1,SUPER24H_Málaga_1,"Plaza, Costitución, 56",Málaga
1,2,SUPER24H_Málaga_2,"Calle, América, 86",Málaga
2,3,SUPER24H_Málaga_3,"Plaza, Costitución, 148",Málaga
3,4,SUPER24H_Málaga_4,"Calle, Costitución, 32",Málaga
4,5,SUPER24H_Málaga_5,"Calle, Pacífico, 116",Málaga
5,6,SUPER24H_Madrid_1,"Plaza, Pacífico, 57",Madrid
6,7,SUPER24H_Madrid_2,"Plaza, Libertad, 49",Madrid
7,8,SUPER24H_Madrid_3,"Plaza, Pacífico, 124",Madrid
8,9,SUPER24H_Madrid_4,"Plaza, Costitución, 109",Madrid
9,10,SUPER24H_Madrid_5,"Calle, América, 149",Madrid
10,11,SUPER24H_San Sebastian_1,"Avenida, Conocimiento, 6",San Sebastian
11,12,SUPER24H_San Sebastian_2,"Avenida, Pacífico, 18",San Sebastian
12,13,SUPER24H_San Sebastian_3,"Calle, Conocimiento, 29",San Sebastian
13,14,SUPER24H_San Sebastian_4,"Avenida, Conocimiento, 108",San Sebastian
14,15,SUPER24H_San Sebastian_5,"Plaza, Costitución, 7",San Sebastian

## EMPLEADOS

In [51]:
def selec_puesto(num, puestos):
    if num < 5:
        return puestos[0]
    elif num < 10:
        return puestos[1]
    elif num < 15:
        return puestos[2]
    elif num < 19:
        return puestos[3]
    else:
        return puestos[4]

puestos = ['Cajero', 'Reponedor', 'Mozo de Almacen', 'Jefe de Seccion', 'Gerente']
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
tiendas = df_tienda['id_tienda']
empleados = []

for tienda in tiendas:
    for num in range(20):
        nombre = f'{random.choice(nombres)} {random.choice(apellidos)} {random.choice(apellidos)}'
        puesto = selec_puesto(num, puestos)
        empleados.append([nombre, puesto, tienda])
        
df_empleados = pd.DataFrame(empleados, columns=['nombre_empleado', 'puesto', 'id_tienda'])
df_empleados=df_empleados.reset_index().rename({'index': 'id_empleado'}, axis=1)
df_empleados['id_empleado'] = df_empleados['id_empleado'] + 1
df_empleados

     id_empleado            nombre_empleado           puesto  id_tienda
0              1         Nerea García Pérez           Cajero          1
1              2     Cecilia Martínez López           Cajero          1
2              3       Luis Hernández Pérez           Cajero          1
3              4  Carmen Martínez Rodríguez           Cajero          1
4              5          Cecilia Díaz Cruz           Cajero          1
..           ...                        ...              ...        ...
295          296         Carlos López López  Jefe de Seccion         15
296          297   Carmen Ramírez Rodríguez  Jefe de Seccion         15
297          298        Pablo Flores Flores  Jefe de Seccion         15
298          299      Nerea Rodríguez López  Jefe de Seccion         15
299          300       Noelia Martínez Cruz          Gerente         15

[300 rows x 4 columns]

## CATEGORIAS

In [52]:
categorias = [
    'Frutería',
    'Carnicería',
    'Pescadería',
    'Panadería y Pastelería',
    'Lácteos y Huevos',
    'Bebidas',
    'Droguería y Limpieza',
    'Conservas y Alimentos enlatados',
    'Congelados',
    'Alimentos Secos y Básicos'
]

df_categorias = pd.DataFrame(categorias, columns=['nombre_categoria'])
df_categorias=df_categorias.reset_index().rename({'index': 'id_categoria'}, axis=1)
df_categorias['id_categoria'] = df_categorias['id_categoria'] + 1
df_categorias

   id_categoria                 nombre_categoria
0             1                         Frutería
1             2                       Carnicería
2             3                       Pescadería
3             4           Panadería y Pastelería
4             5                 Lácteos y Huevos
5             6                          Bebidas
6             7             Droguería y Limpieza
7             8  Conservas y Alimentos enlatados
8             9                       Congelados
9            10        Alimentos Secos y Básicos

## PRODUCTOS

In [53]:
productos = {
    1: ['Manzanas', 'Plátanos', 'Naranjas', 'Lechugas'],  # Frutería
    2: ['Pollo', 'Ternera', 'Cerdo', 'Cordero'],           # Carnicería
    3: ['Merluza', 'Salmón', 'Atún', 'Calamares'],         # Pescadería
    4: ['Pan integral', 'Croissants', 'Donuts', 'Baguette'], # Panadería y Pastelería
    5: ['Leche', 'Queso', 'Yogur', 'Huevos'],              # Lácteos y Huevos
    6: ['Agua', 'Refrescos', 'Vino tinto', 'Cerveza'],     # Bebidas
    7: ['Detergente', 'Esponjas', 'Desinfectante', 'Papel higiénico'], # Droguería y Limpieza
    8: ['Atún enlatado', 'Sopa de tomate', 'Maíz dulce', 'Guisantes en conserva'], # Conservas y Alimentos enlatados
    9: ['Pizza congelada', 'Helado', 'Verduras congeladas', 'Nuggets de pollo'], # Congelados
    10: ['Arroz', 'Pasta', 'Lentejas', 'Harina']          # Alimentos Secos y Básicos
}

producto_completo = []

for categoria in df_categorias['id_categoria']:
    for producto in productos[categoria]:
        precio = round(random.uniform(0.50, 150.00), 2)
        stock = random.randint(0,500)
        producto_completo.append([producto, precio, stock, categoria])
        
df_productos = pd.DataFrame(producto_completo, columns=['nombre_producto','precio','stock', 'id_categoria'])
df_productos=df_productos.reset_index().rename({'index': 'id_producto'}, axis=1)
df_productos['id_producto'] = df_productos['id_producto'] + 1
df_productos

    id_producto        nombre_producto  precio  stock  id_categoria
0             1               Manzanas   55.24    341             1
1             2               Plátanos    3.69    278             1
2             3               Naranjas   35.31    500             1
3             4               Lechugas  138.17    153             1
4             5                  Pollo   92.22    240             2
5             6                Ternera   78.53    192             2
6             7                  Cerdo   24.67    252             2
7             8                Cordero  120.71    201             2
8             9                Merluza   48.44    202             3
9            10                 Salmón   31.16    146             3
10           11                   Atún   13.78    105             3
11           12              Calamares  141.95    166             3
12           13           Pan integral   95.27    413             4
13           14             Croissants  116.06    229             4
14           15                 Donuts   68.41    498             4
15           16               Baguette   56.28    108             4
16           17                  Leche   83.70    275             5
17           18                  Queso   65.16    320             5
18           19                  Yogur  138.98     23             5
19           20                 Huevos   94.69    447             5
20           21                   Agua  103.69     26             6
21           22              Refrescos  125.04    324             6
22           23             Vino tinto   97.96    255             6
23           24                Cerveza  114.97    306             6
24           25             Detergente  121.08    461             7
25           26               Esponjas  139.60    110             7
26           27          Desinfectante    0.86    362             7
27           28        Papel higiénico   55.79    310             7
28           29          Atún enlatado  127.71    175             8
29           30         Sopa de tomate   77.14     46             8
30           31             Maíz dulce  138.98    266             8
31           32  Guisantes en conserva   72.55    203             8
32           33        Pizza congelada  120.27      6             9
33           34                 Helado   98.68    434             9
34           35    Verduras congeladas  125.17     83             9
35           36       Nuggets de pollo   54.24    129             9
36           37                  Arroz   30.37    329            10
37           38                  Pasta   67.18    250            10
38           39               Lentejas   15.93    114            10
39           40                 Harina   29.11     75            10

## CLIENTES

In [54]:
nombres = ['Carolina', 'Cecilia', 'Alan', 'Kike', 'Panchi', 'Carlos', 'Carmen', 'Emilio', 'Jose Ignacio', 'Luis', 'Maria', 'Marino','Nerea','Noelia', 'Oscar', 'Pablo', 'Rafael']
apellidos = ['García', 'Martínez', 'López', 'Hernández', 'González', 'Pérez', 'Rodríguez', 'Sánchez', 'Ramírez', 'Torres', 'Flores', 'Rivera', 'Díaz', 'Cruz', 'Morales']
emails = ['gmail', 'yahoo', 'hotmail']
codigo_postal = [29000, 28000, 20000]

cliente = []

for num in range (2000):
    nombre = f'{random.choice(nombres)}'
    apellido = f'{random.choice(apellidos)} {random.choice(apellidos)}'
    email = f'{nombre.lower()}.{apellido.split()[0][:1].lower()}{apellido.split()[1][:1].lower()}@{random.choice(emails)}.com'
    cp = random.choice(codigo_postal) + random.randint(1, 25)
    cliente.append([nombre, apellido, email, cp])
    
df_clientes = pd.DataFrame(cliente, columns=['first_name','last_name','email','codigo_postal'])
df_clientes=df_clientes.reset_index().rename({'index': 'id_cliente'}, axis=1)
df_clientes['id_cliente'] = df_clientes['id_cliente'] + 1
df_clientes

,id_cliente,first_name,last_name,email,codigo_postal
0,1,Oscar,García González,oscar.gg@gmail.com,29015
1,2,Rafael,Flores Rivera,rafael.fr@yahoo.com,20015
2,3,Oscar,González Hernández,oscar.gh@yahoo.com,29001
3,4,Alan,Flores Cruz,alan.fc@yahoo.com,29005
4,5,Pablo,Díaz Pérez,pablo.dp@gmail.com,28016
...,...,...,...,...,...
1995,1996,Marino,Hernández Cruz,marino.hc@yahoo.com,28016
1996,1997,Marino,Sánchez Rivera,marino.sr@yahoo.com,29001
1997,1998,Noelia,Díaz García,noelia.dg@gmail.com,28016
1998,1999,Pablo,González López,pablo.gl@gmail.com,29010
1999,2000,Pablo,Morales Martínez,pablo.mm@yahoo.com,20014

## ORDENES

In [55]:
import datetime
from datetime import datetime, timedelta

clientes = df_clientes['id_cliente']
empleados = df_empleados['id_empleado']
ordenes = []

fecha_inicial = datetime(year=2017, month=1, day=2, hour=9, minute=00)
for orden in range (10000):
    cliente = int(random.choice(clientes))
    empleado = int(random.choice(empleados))
    fecha = fecha_inicial + timedelta(minutes=30*orden)
    metodo = random.choice(['Tarjeta', 'Efectivo'])
    ordenes.append([cliente, empleado, fecha, metodo])
    
df_ordenes = pd.DataFrame(ordenes, columns=['id_cliente','id_empleado', 'fecha_orden', 'metodo_pago'])
df_ordenes=df_ordenes.reset_index().rename({'index': 'id_orden'}, axis=1)
df_ordenes['id_orden'] = df_ordenes['id_orden'] + 1
df_ordenes

      id_orden  id_cliente  id_empleado         fecha_orden metodo_pago
0            1        1883           38 2017-01-02 09:00:00    Efectivo
1            2         158           19 2017-01-02 09:30:00     Tarjeta
2            3         489          136 2017-01-02 10:00:00     Tarjeta
3            4         815          265 2017-01-02 10:30:00     Tarjeta
4            5        1317           73 2017-01-02 11:00:00    Efectivo
...        ...         ...          ...                 ...         ...
9995      9996         398          119 2017-07-29 14:30:00     Tarjeta
9996      9997        1223           42 2017-07-29 15:00:00     Tarjeta
9997      9998         234          154 2017-07-29 15:30:00     Tarjeta
9998      9999         432          177 2017-07-29 16:00:00     Tarjeta
9999     10000        1140           12 2017-07-29 16:30:00     Tarjeta

[10000 rows x 5 columns]

## DETALLE ORDEN

In [56]:
productos = df_productos['id_producto']
ordenes = df_ordenes['id_orden']
detalles = []

for orden in ordenes:
    for num in range(1, 4):
        producto = int(random.choice(productos))
        cantidad = random.randint(1,20)
        descuento = float(round(random.uniform(0.00, 5.00), 2))
        precio = float(round(df_productos['precio'][df_productos['id_producto'] == producto].iloc[0]))
        detalles.append([orden, producto, cantidad, precio, descuento])
        
df_detalles_orden = pd.DataFrame(detalles, columns=['id_orden','id_producto', 'cantidad', 'precio_unitario', 'descuento'])
df_detalles_orden=df_detalles_orden.reset_index().rename({'index': 'id_detalle'}, axis=1)
df_detalles_orden['id_detalle'] = df_detalles_orden['id_detalle'] + 1
df_detalles_orden

       id_detalle  id_orden  id_producto  cantidad  precio_unitario  descuento
0               1         1            4        17            138.0       4.19
1               2         1           32        15             73.0       1.88
2               3         1           25        10            121.0       3.31
3               4         2            8        11            121.0       3.71
4               5         2           22         4            125.0       1.10
...           ...       ...          ...       ...              ...        ...
29995       29996      9999           27         5              1.0       1.33
29996       29997      9999           34        17             99.0       1.19
29997       29998     10000            1         9             55.0       1.80
29998       29999     10000           31         3            139.0       1.54
29999       30000     10000            6         6             79.0       3.91

[30000 rows x 6 columns]

## CARGA DE DATOS CON PANDAS

Crear la conexion

In [57]:
user = "root"
password = "admin"
database = "supermercado"

# Crear la conexión
engine = create_engine(f"mysql+pymysql://{user}:{password}@localhost/{database}")

# Abrir una conección
connection = engine.connect()

# Cerrar la conección
connection.close()

Carga de datos

In [58]:
df_tienda.to_sql(name = "tiendas", con = engine, if_exists = "append", index = False)
df_empleados.to_sql(name = "empleados", con = engine, if_exists = "append", index = False)
df_categorias.to_sql(name = "categorias", con = engine, if_exists = "append", index = False)
df_productos.to_sql(name = "productos", con = engine, if_exists = "append", index = False)
df_clientes.to_sql(name = "clientes", con = engine, if_exists = "append", index = False)
df_ordenes.to_sql(name = "ordenes", con = engine, if_exists = "append", index = False)
df_detalles_orden.to_sql(name = "detalle_orden", con = engine, if_exists = "append", index = False)

30000

# PARTE 3: CONSULTAS SQL

1. Listado de órdenes con detalles de cliente y empleado
* Muestra el ID de la orden, la fecha, el nombre del cliente, el nombre del empleado que atendió la compra y el método de pago.
* Utiliza un JOIN entre las tablas ordenes, clientes y empleados.

In [59]:
sql = """ 
SELECT 
	o.id_orden, 
    o.fecha_orden, 
    concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    e.nombre_empleado,
    o.metodo_pago
FROM
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado;
"""

df = pd.read_sql(sql, engine)

df

,id_orden,fecha_orden,nombre_cliente,nombre_empleado,metodo_pago
0,209,2017-01-06 17:00:00,Panchi Pérez Rivera,Nerea García Pérez,Efectivo
1,263,2017-01-07 20:00:00,Nerea Martínez Díaz,Nerea García Pérez,Efectivo
2,553,2017-01-13 21:00:00,Panchi Sánchez González,Nerea García Pérez,Efectivo
3,678,2017-01-16 11:30:00,Carlos Flores Morales,Nerea García Pérez,Tarjeta
4,1038,2017-01-23 23:30:00,Maria Sánchez Martínez,Nerea García Pérez,Efectivo
...,...,...,...,...,...
9995,8357,2017-06-25 11:00:00,Noelia Rodríguez Rodríguez,Noelia Martínez Cruz,Tarjeta
9996,8372,2017-06-25 18:30:00,Carolina Díaz Flores,Noelia Martínez Cruz,Efectivo
9997,8450,2017-06-27 09:30:00,Nerea Hernández Martínez,Noelia Martínez Cruz,Tarjeta
9998,8982,2017-07-08 11:30:00,Oscar García Torres,Noelia Martínez Cruz,Efectivo
9999,9764,2017-07-24 18:30:00,Rafael Flores González,Noelia Martínez Cruz,Tarjeta


2. Productos con stock bajo
* Filtra aquellos productos cuyo stock sea menor a 10.
* Muestra nombre del producto, categoría y stock.

In [60]:
sql = """ 
SELECT 
	p.nombre_producto, 
    c.nombre_categoria, 
    p.stock
FROM 
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
WHERE p.stock < 10;
"""

df = pd.read_sql(sql, engine)

df

   nombre_producto nombre_categoria  stock
0  Pizza congelada       Congelados      6

3. Ventas totales por categoría
* Muestra el nombre de la categoría y la suma total de las ventas (ej.: multiplicando cantidad * precio_unitario) para cada categoría.
* Realiza el JOIN con detalle_orden, productos y categorias.
* Utiliza agrupación (GROUP BY).

In [61]:
sql = """ 
SELECT
	c.nombre_categoria, sum(d.precio_unitario*d.cantidad) as Venta_Total
FROM
	productos p
JOIN
	categorias c on p.id_categoria = c.id_categoria
JOIN
	detalle_orden d on p.id_producto = d.id_producto
GROUP BY c.nombre_categoria
"""

df = pd.read_sql(sql, engine)

df

                  nombre_categoria  Venta_Total
0                         Frutería    1946800.0
1                       Carnicería    2412050.0
2                       Pescadería    1843279.0
3           Panadería y Pastelería    2642483.0
4                 Lácteos y Huevos    2934445.0
5                          Bebidas    3398312.0
6             Droguería y Limpieza    2459830.0
7  Conservas y Alimentos enlatados    3290494.0
8                       Congelados    3184313.0
9        Alimentos Secos y Básicos    1094146.0

4. Clientes con mayores gastos acumulados
* Muestra el nombre del cliente y el monto total que ha gastado (suma de todas sus órdenes).
* Asegúrate de tener en cuenta posibles descuentos (descuento) si se ha definido. Por ejemplo, la fórmula podría ser (cantidad * precio_unitario) - descuento.
* Ordena el resultado de mayor a menor gasto acumulado.

In [62]:
sql = """ 
SELECT 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    sum((d.precio_unitario*d.cantidad)-d.descuento) as Gasto_Total_Con_Descuento,
    sum(d.precio_unitario*d.cantidad) as Gasto_Total_Sin_Descuento
FROM 
	ordenes o
JOIN
	clientes c on o.id_cliente = c.id_cliente
JOIN
	detalle_orden d on o.id_orden = d.id_orden
GROUP BY nombre_cliente
ORDER BY Gasto_Total_Con_Descuento DESC;
"""

df = pd.read_sql(sql, engine)

df

,nombre_cliente,Gasto_Total_Con_Descuento,Gasto_Total_Sin_Descuento
0,Oscar López Martínez,71167.36,71371.0
1,Maria Flores Sánchez,69282.23,69489.0
2,Noelia Díaz Ramírez,63125.27,63295.0
3,Kike Díaz Cruz,59470.05,59654.0
4,Rafael García Rivera,58916.48,59083.0
...,...,...,...
1543,Kike Flores Martínez,1101.93,1110.0
1544,Rafael Hernández Rivera,955.27,964.0
1545,Kike Martínez Sánchez,897.66,908.0
1546,Kike Cruz Morales,648.25,652.0
1547,Rafael Díaz Hernández,152.01,161.0

5. Empleados y número de órdenes gestionadas
* Muestra el nombre del empleado, el puesto y la cantidad de órdenes que ha gestionado.
* Utiliza GROUP BY y COUNT.

In [63]:
sql = """ 
SELECT
	e.nombre_empleado, 
    e.puesto, 
    count(o.id_empleado) as gestionadas
FROM 
	empleados e
JOIN
	ordenes o on e.id_empleado=o.id_empleado
GROUP BY e.nombre_empleado, e.puesto
"""

df = pd.read_sql(sql, engine)

df

               nombre_empleado           puesto  gestionadas
0           Nerea García Pérez           Cajero           29
1       Cecilia Martínez López           Cajero           32
2         Luis Hernández Pérez           Cajero           29
3    Carmen Martínez Rodríguez           Cajero           37
4            Cecilia Díaz Cruz           Cajero           21
..                         ...              ...          ...
290         Carlos López López  Jefe de Seccion           36
291   Carmen Ramírez Rodríguez  Jefe de Seccion           31
292        Pablo Flores Flores  Jefe de Seccion           28
293      Nerea Rodríguez López  Jefe de Seccion           34
294       Noelia Martínez Cruz          Gerente           26

[295 rows x 3 columns]

6. Ordenes filtradas por fecha y tienda
* Muestra todas las órdenes que se realizaron en un rango de fechas determinado (ej.: del 1 de enero de 2025 al 31 de enero de 2025) y en una tienda específica.
* Incluye datos de la tienda y del cliente.

In [64]:
sql = """ 
SELECT 
	t.nombre_tienda, 
	concat(c.first_name, ' ', c.last_name) AS nombre_cliente,
    o.*
FROM 
	ordenes o
JOIN 
	clientes c on o.id_cliente = c.id_cliente
JOIN
	empleados e on o.id_empleado = e.id_empleado
JOIN
	tiendas t on e.id_tienda = t.id_tienda
WHERE o.fecha_orden > "2017-01-31 23:59:00" AND o.fecha_orden < "2017-03-01";
"""

df = pd.read_sql(sql, engine)

df

,nombre_tienda,nombre_cliente,id_orden,id_cliente,id_empleado,fecha_orden,metodo_pago
0,SUPER24H_Málaga_1,Jose Ignacio Pérez Sánchez,1425,1846,1,2017-02-01 01:00:00,Efectivo
1,SUPER24H_Málaga_1,Luis Hernández Ramírez,1801,1948,1,2017-02-08 21:00:00,Efectivo
2,SUPER24H_Málaga_1,Panchi Morales Díaz,1930,1034,1,2017-02-11 13:30:00,Tarjeta
3,SUPER24H_Málaga_1,Marino Sánchez Pérez,2051,861,1,2017-02-14 02:00:00,Efectivo
4,SUPER24H_Málaga_1,Pablo López Cruz,2357,933,1,2017-02-20 11:00:00,Tarjeta
...,...,...,...,...,...,...,...
1339,SUPER24H_San Sebastian_5,Oscar Rodríguez Rivera,2121,1122,300,2017-02-15 13:00:00,Efectivo
1340,SUPER24H_San Sebastian_5,Panchi Cruz Torres,2493,23,300,2017-02-23 07:00:00,Tarjeta
1341,SUPER24H_San Sebastian_5,Panchi Morales Cruz,2524,1152,300,2017-02-23 22:30:00,Tarjeta
1342,SUPER24H_San Sebastian_5,Nerea Martínez Martínez,2635,1922,300,2017-02-26 06:00:00,Efectivo
1343,SUPER24H_San Sebastian_5,Carmen Hernández Rodríguez,2720,820,300,2017-02-28 00:30:00,Tarjeta

7. Ranking de productos más vendidos en cada tienda
* Para cada tienda, muestra los 3 productos más vendidos (en términos de cantidad total).
* Tendrás que unir tiendas, empleados, ordenes y detalle_orden, además de productos.
* Usa GROUP BY y ordena por la cantidad sumada (y opcionalmente, un LIMIT 3).

In [66]:
sql = """ 
SELECT 
    t1.nombre_tienda,
    t1.nombre_producto,
    t1.cantidad_total
FROM (
    SELECT
        t.nombre_tienda,
        p.nombre_producto,
        SUM(d.cantidad) AS cantidad_total
    FROM
        tiendas t
    JOIN 
        empleados e ON t.id_tienda = e.id_tienda
    JOIN
        ordenes o ON e.id_empleado = o.id_empleado
    JOIN
        detalle_orden d ON o.id_orden = d.id_orden
    JOIN
        productos p ON d.id_producto = p.id_producto
    GROUP BY 
        t.nombre_tienda, p.nombre_producto
) t1
WHERE 
    (
        SELECT COUNT(*)
        FROM (
            SELECT
                t.nombre_tienda,
                p.nombre_producto,
                SUM(d.cantidad) AS cantidad_total
            FROM
                tiendas t
            JOIN 
                empleados e ON t.id_tienda = e.id_tienda
            JOIN
                ordenes o ON e.id_empleado = o.id_empleado
            JOIN
                detalle_orden d ON o.id_orden = d.id_orden
            JOIN
                productos p ON d.id_producto = p.id_producto
            GROUP BY 
                t.nombre_tienda, p.nombre_producto
        ) sub
        WHERE sub.nombre_tienda = t1.nombre_tienda
        AND sub.cantidad_total > t1.cantidad_total
    ) < 3
ORDER BY 
    t1.nombre_tienda, t1.cantidad_total DESC;
"""

df = pd.read_sql(sql, engine)

df

               nombre_tienda        nombre_producto  cantidad_total
0          SUPER24H_Madrid_1               Naranjas           709.0
1          SUPER24H_Madrid_1               Esponjas           644.0
2          SUPER24H_Madrid_1          Atún enlatado           618.0
3          SUPER24H_Madrid_2          Desinfectante           764.0
4          SUPER24H_Madrid_2                 Helado           718.0
5          SUPER24H_Madrid_2                   Agua           666.0
6          SUPER24H_Madrid_3                 Donuts           654.0
7          SUPER24H_Madrid_3                Merluza           642.0
8          SUPER24H_Madrid_3                 Huevos           614.0
9          SUPER24H_Madrid_4  Guisantes en conserva           746.0
10         SUPER24H_Madrid_4               Plátanos           733.0
11         SUPER24H_Madrid_4          Atún enlatado           658.0
12         SUPER24H_Madrid_4                 Helado           658.0
13         SUPER24H_Madrid_5                Ternera           715.0
14         SUPER24H_Madrid_5                   Atún           670.0
15         SUPER24H_Madrid_5             Detergente           664.0
16         SUPER24H_Málaga_1                   Atún           701.0
17         SUPER24H_Málaga_1                Merluza           680.0
18         SUPER24H_Málaga_1           Pan integral           669.0
19         SUPER24H_Málaga_2                 Helado           719.0
20         SUPER24H_Málaga_2                   Agua           652.0
21         SUPER24H_Málaga_2  Guisantes en conserva           637.0
22         SUPER24H_Málaga_3        Pizza congelada           722.0
23         SUPER24H_Málaga_3               Lechugas           708.0
24         SUPER24H_Málaga_3               Naranjas           683.0
25         SUPER24H_Málaga_3          Atún enlatado           683.0
26         SUPER24H_Málaga_4        Papel higiénico           668.0
27         SUPER24H_Málaga_4               Naranjas           636.0
28         SUPER24H_Málaga_4                  Leche           634.0
29         SUPER24H_Málaga_5                   Atún           757.0
30         SUPER24H_Málaga_5               Manzanas           655.0
31         SUPER24H_Málaga_5        Pizza congelada           649.0
32  SUPER24H_San Sebastian_1                Cordero           686.0
33  SUPER24H_San Sebastian_1          Desinfectante           653.0
34  SUPER24H_San Sebastian_1               Naranjas           648.0
35  SUPER24H_San Sebastian_2                 Donuts           699.0
36  SUPER24H_San Sebastian_2        Pizza congelada           642.0
37  SUPER24H_San Sebastian_2               Lentejas           629.0
38  SUPER24H_San Sebastian_3        Pizza congelada           777.0
39  SUPER24H_San Sebastian_3                   Atún           642.0
40  SUPER24H_San Sebastian_3               Naranjas           628.0
41  SUPER24H_San Sebastian_4             Croissants           763.0
42  SUPER24H_San Sebastian_4               Lechugas           683.0
43  SUPER24H_San Sebastian_4               Esponjas           663.0
44  SUPER24H_San Sebastian_5                  Cerdo           671.0
45  SUPER24H_San Sebastian_5       Nuggets de pollo           670.0
46  SUPER24H_San Sebastian_5                Merluza           660.0